# 곱셈

# 힌트1 ?
# 나머지 = 값 - 몫 * 나눈값
# 나머지 = 값 - 몫 * C

# 힌트2 ?
# 0~ c까지는 C로 나눈 값이 같다

# 2 1 5
# 2 % 5 = 0

# 2 2 5
# 4 % 5 = 0

# 2 3 5
# 8 % 5 = 3

# 2 4 5
# 16 % 5 = 1

# 2 5 5
# 32 % 5 = 2

# 2 6 5
# 64 % 5 = 4

# 2 7 5
# 128 % 5 = 3

# 2 8 5
# 256 % 5 = 1

# 2 9 5
# 512 % 5 = 2

a, b, c = map(int, input().split())
stack = []


# 접근 : 2^32 -> (2^16)^2 -> ((2^8)^2)^2...
def dac(a, b, c):
    if b == 1:
        return a % c
    elif b % 2 == 0:
        return (dac(a, b // 2, c) ** 2) % c
    else:
        return ((dac(a, b // 2, c) ** 2) * a) % c


print(dac(a, b, c))
